backend/test/load/authentication.yml
config:
  target: "http://localhost:7070"
  phases:
    - duration: 60
      arrivalRate: 10 # 10 users/sec
scenarios:
    - name: "User authentication"
      flow:
        - post:
            url: "/user/auth"
            json:
              googleId: "load_test_user_at_least_21_characters{{ $randomNumber() }}"
              nickName: 'Nick_name'